In [2]:
# read a datasets of top rated IMDB movies into a DataFrame from url
import pandas as pd
mdf = pd.read_csv('http://bit.ly/imdbratings')

In [3]:
mdf.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [4]:
mdf.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [5]:
subset = mdf[['star_rating', 'duration']]
subset.head()

   star_rating  duration
0          9.3       142
1          9.2       175
2          9.1       200
3          9.0       152
4          8.9       154

# Titanic Datasets

### Using Loc

In [6]:
# read a datasets of titanic into a DataFrame from Host
data_path = r'C:\Users\Sphinx\Desktop\ML\Data Wrangling in Pandas for Machine Learning Engineers\2. Pandas Dataframe Basics\Data\titanic.csv'
tdf = pd.read_csv(data_path)

In [7]:
tdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
tdf.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### loc(row, row, ......) means row number of the loaded datasets

In [9]:
subset = tdf.loc[[0, 2, 4, 200]]

In [10]:
subset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S
200,201,0,3,"Vande Walle, Mr. Nestor Cyriel",male,28.0,0,0,345770,9.500,NaN,S

### Using iloc and ix

In [11]:
subset = tdf.iloc[[0, 2, 4, 200]]
subset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S
200,201,0,3,"Vande Walle, Mr. Nestor Cyriel",male,28.0,0,0,345770,9.500,NaN,S

In [12]:
subset = tdf.ix[0]
subset

c:\users\sphinx\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [13]:
tdf.iloc[[0]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 0 to 0
Data columns (total 12 columns):
PassengerId    1 non-null int64
Survived       1 non-null int64
Pclass         1 non-null int64
Name           1 non-null object
Sex            1 non-null object
Age            1 non-null float64
SibSp          1 non-null int64
Parch          1 non-null int64
Ticket         1 non-null object
Fare           1 non-null float64
Cabin          0 non-null object
Embarked       1 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 104.0+ bytes

### subsetting rows and columns

In [14]:
# show value column wise  of a row
subset = tdf.iloc[0]
subset

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [15]:
# retrive data of each column by indexing
subset = tdf.iloc[0]
subset[3]

'Braund, Mr. Owen Harris'

In [16]:
# show data row wise
subset = tdf.iloc[[1]]
subset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [17]:
# ix here used for show value column wise  of a row and retrive specific column value by its name 
values = tdf.ix[0, 'Fare'] # or tdf.loc[0, 'Fare']
values

c:\users\sphinx\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

7.25

In [18]:
# retrive value from specific row and cols
# tdf.ix[[rows....], [cols...]]
subset =  tdf.ix[[0, 2, 4], [1, 4, 5]] # or tdf.iloc[[0, 2, 4], [1, 4, 5]]
subset

c:\users\sphinx\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

   Survived     Sex   Age
0         0    male  22.0
2         1  female  26.0
4         0    male  35.0

## grouping DataFrame values

In [19]:
# check count total passernger  of each individual Age  
group = tdf.groupby('Age').PassengerId.count()
group.head()

Age
0.42    1
0.67    1
0.75    2
0.83    2
0.92    1
Name: PassengerId, dtype: int64

In [20]:
# check survived mean of each passenger class 
# check mean survived % with respect to passenger class(Pclass)
group = tdf.groupby('Pclass')['Survived'].mean()
group

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [22]:
# check mean Age  % with respect to passenger class(Pclass)
group = tdf.groupby('Pclass')['Age'].mean()
group

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [23]:
# check all description of  Age  % with respect to passenger class(Pclass)
group = tdf.groupby('Pclass')['Age'].describe()
group

        count       mean        std   min   25%   50%   75%   max
Pclass
1       186.0  38.233441  14.802856  0.92  27.0  37.0  49.0  80.0
2       173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0
3       355.0  25.140620  12.495398  0.42  18.0  24.0  32.0  74.0